MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/M2354LJFCE/mcu.h
/**@}*/ /* end of group CMSIS */

#include "core_armv8mbl.h"                  /* Processor and core peripherals */
// Note: Changed for MikroE implementation.
//#include "system_M2354.h"                   /* System Header */
#define __I volatile // Note: Added for MikroE implementation.
#define __O __I // Note: Added for MikroE implementation.
#define __IO __I // Note: Added for MikroE implementation.
#include <stdint.h>
// Note: Changed for MikroE implementation.
//#include "partition_M2354.h"

/**
 * Initialize the system clock
 *
 * @brief  Setup the micro controller system
 *         Initialize the PLL and update the SystemFrequency variable
 */
extern void SystemInit(void);


/******************************************************************************/
/*                Device Specific Peripheral registers structures             */
/******************************************************************************/


// Note: Changed for MikroE implementation.
//#include "acmp_reg.h"
// Note: Changed for MikroE implementation.
//#include "bpwm_reg.h"
// Note: Changed for MikroE implementation.
//#include "can_reg.h"
// Note: Changed for MikroE implementation.
//#include "clk_reg.h"
// Note: Changed for MikroE implementation.
//#include "crc_reg.h"
// Note: Changed for MikroE implementation.
//#include "dac_reg.h"
// Note: Changed for MikroE implementation.
//#include "eadc_reg.h"
// Note: Changed for MikroE implementation.
//#include "ebi_reg.h"
// Note: Changed for MikroE implementation.
//#include "ecap_reg.h"
// Note: Changed for MikroE implementation.
//#include "fmc_reg.h"
// Note: Changed for MikroE implementation.
//#include "gpio_reg.h"
// Note: Changed for MikroE implementation.
//#include "i2c_reg.h"
// Note: Changed for MikroE implementation.
//#include "i2s_reg.h"
// Note: Changed for MikroE implementation.
//#include "pdma_reg.h"
// Note: Changed for MikroE implementation.
//#include "epwm_reg.h"
// Note: Changed for MikroE implementation.
//#include "qei_reg.h"
// Note: Changed for MikroE implementation.
//#include "rtc_reg.h"
// Note: Changed for MikroE implementation.
//#include "sc_reg.h"
// Note: Changed for MikroE implementation.
//#include "scu_reg.h"
// Note: Changed for MikroE implementation.
//#include "sdh_reg.h"
// Note: Changed for MikroE implementation.
//#include "qspi_reg.h"
// Note: Changed for MikroE implementation.
//#include "spi_reg.h"
// Note: Changed for MikroE implementation.
//#include "sys_reg.h"
// Note: Changed for MikroE implementation.
//#include "timer_reg.h"
// Note: Changed for MikroE implementation.
//#include "trng_reg.h"
// Note: Changed for MikroE implementation.
//#include "uart_reg.h"
// Note: Changed for MikroE implementation.
//#include "ui2c_reg.h"
// Note: Changed for MikroE implementation.
//#include "usbh_reg.h"
// Note: Changed for MikroE implementation.
//#include "usbd_reg.h"
// Note: Changed for MikroE implementation.
//#include "otg_reg.h"
// Note: Changed for MikroE implementation.
//#include "crpt_reg.h"
// Note: Changed for MikroE implementation.
//#include "uspi_reg.h"
// Note: Changed for MikroE implementation.
//#include "uuart_reg.h"
// Note: Changed for MikroE implementation.
//#include "wdt_reg.h"
// Note: Changed for MikroE implementation.
//#include "wwdt_reg.h"
// Note: Changed for MikroE implementation.
//#include "keystore_reg.h"
// Note: Changed for MikroE implementation.
//#include "tamper_reg.h"
// Note: Changed for MikroE implementation.
//#include "lcd_reg.h"
// Note: Changed for MikroE implementation.
//#include "ewdt_reg.h"
// Note: Changed for MikroE implementation.
//#include "ewwdt_reg.h"



/******************************************************************************/
/*                         Peripheral memory map                              */
/******************************************************************************/
/** @addtogroup PERIPHERAL_BASE Peripheral Memory Base
  Memory Mapped Structure for Series Peripheral
  @{
 */


/* Peripheral and SRAM base address */
#define SRAM_BASE            (0x20000000UL)                              /*!< (SRAM      ) Base Address */
#define PERIPH_BASE          (0x40000000UL)                              /*!< (Peripheral) Base Address */
#define NS_OFFSET            (0x10000000UL)

/* Peripheral memory map */
#define AHBPERIPH_BASE       PERIPH_BASE
#define APBPERIPH_BASE       (PERIPH_BASE + 0x00040000UL)

/*!< AHB peripherals */
#define SYS_BASE             (AHBPERIPH_BASE + 0x00000UL)
#define CLK_BASE             (AHBPERIPH_BASE + 0x00200UL)
#define INT_BASE             (AHBPERIPH_BASE + 0x00300UL)
#define GPIO_BASE            (AHBPERIPH_BASE + 0x04000UL)
#define GPIOA_BASE           (AHBPERIPH_BASE + 0x04000UL)
#define GPIOB_BASE           (AHBPERIPH_BASE + 0x04040UL)
#define GPIOC_BASE           (AHBPERIPH_BASE + 0x04080UL)
#define GPIOD_BASE           (AHBPERIPH_BASE + 0x040C0UL)
#define GPIOE_BASE           (AHBPERIPH_BASE + 0x04100UL)
#define GPIOF_BASE           (AHBPERIPH_BASE + 0x04140UL)
#define GPIOG_BASE           (AHBPERIPH_BASE + 0x04180UL)
#define GPIOH_BASE           (AHBPERIPH_BASE + 0x041C0UL)
#define GPIO_DBCTL_BASE      (AHBPERIPH_BASE + 0x04440UL)
#define GPIO_PIN_DATA_BASE   (AHBPERIPH_BASE + 0x04800UL)
#define PDMA0_BASE           (AHBPERIPH_BASE + 0x08000UL)
#define PDMA1_BASE           (AHBPERIPH_BASE + 0x18000UL)
#define USBH_BASE            (AHBPERIPH_BASE + 0x09000UL)
#define FMC_BASE             (AHBPERIPH_BASE + 0x0C000UL)
#define SDH0_BASE            (AHBPERIPH_BASE + 0x0D000UL)
#define SDH1_BASE            (AHBPERIPH_BASE + 0x0E000UL)
#define EBI_BASE             (AHBPERIPH_BASE + 0x10000UL)
#define CRC_BASE             (AHBPERIPH_BASE + 0x31000UL)
#define CRPT_BASE            (AHBPERIPH_BASE + 0x32000UL)
#define SCU_BASE             (AHBPERIPH_BASE + 0x2F000UL)
#define FVC_BASE             (AHBPERIPH_BASE + 0x2F500UL)
#define DPM_BASE             (AHBPERIPH_BASE + 0x2F600UL)
#define PLM_BASE             (AHBPERIPH_BASE + 0x2F700UL)

