MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/M2354LJFCE/mcu.h
#define BTF_BASE             (AHBPERIPH_BASE + 0x2F800UL)

/*!< APB peripherals */
#define WDT_BASE             (APBPERIPH_BASE + 0x00000UL)
#define WWDT_BASE            (APBPERIPH_BASE + 0x00100UL)
#define RTC_BASE             (APBPERIPH_BASE + 0x01000UL)
#define EADC_BASE            (APBPERIPH_BASE + 0x03000UL)
#define ACMP01_BASE          (APBPERIPH_BASE + 0x05000UL)
#define DAC0_BASE            (APBPERIPH_BASE + 0x07000UL)
#define DAC1_BASE            (APBPERIPH_BASE + 0x07040UL)
#define I2S0_BASE            (APBPERIPH_BASE + 0x08000UL)
#define OTG_BASE             (APBPERIPH_BASE + 0x0D000UL)
#define TMR01_BASE           (APBPERIPH_BASE + 0x10000UL)
#define TMR23_BASE           (APBPERIPH_BASE + 0x11000UL)
#define TMR45_BASE           (APBPERIPH_BASE + 0x12000UL)
#define EPWM0_BASE           (APBPERIPH_BASE + 0x18000UL)
#define EPWM1_BASE           (APBPERIPH_BASE + 0x19000UL)
#define BPWM0_BASE           (APBPERIPH_BASE + 0x1A000UL)
#define BPWM1_BASE           (APBPERIPH_BASE + 0x1B000UL)
#define QSPI0_BASE           (APBPERIPH_BASE + 0x20000UL)
#define SPI0_BASE            (APBPERIPH_BASE + 0x21000UL)
#define SPI1_BASE            (APBPERIPH_BASE + 0x22000UL)
#define SPI2_BASE            (APBPERIPH_BASE + 0x23000UL)
#define SPI3_BASE            (APBPERIPH_BASE + 0x24000UL)
#define UART0_BASE           (APBPERIPH_BASE + 0x30000UL)
#define UART0_BASE           (APBPERIPH_BASE + 0x30000UL)
#define UART1_BASE           (APBPERIPH_BASE + 0x31000UL)
#define UART2_BASE           (APBPERIPH_BASE + 0x32000UL)
#define UART3_BASE           (APBPERIPH_BASE + 0x33000UL)
#define UART4_BASE           (APBPERIPH_BASE + 0x34000UL)
#define UART5_BASE           (APBPERIPH_BASE + 0x35000UL)
#define I2C0_BASE            (APBPERIPH_BASE + 0x40000UL)
#define I2C1_BASE            (APBPERIPH_BASE + 0x41000UL)
#define I2C2_BASE            (APBPERIPH_BASE + 0x42000UL)
#define SC0_BASE             (APBPERIPH_BASE + 0x50000UL)
#define SC1_BASE             (APBPERIPH_BASE + 0x51000UL)
#define SC2_BASE             (APBPERIPH_BASE + 0x52000UL)
#define CAN0_BASE            (APBPERIPH_BASE + 0x60000UL)
#define QEI0_BASE            (APBPERIPH_BASE + 0x70000UL)
#define QEI1_BASE            (APBPERIPH_BASE + 0x71000UL)
#define ECAP0_BASE           (APBPERIPH_BASE + 0x74000UL)
#define ECAP1_BASE           (APBPERIPH_BASE + 0x75000UL)
#define TRNG_BASE            (APBPERIPH_BASE + 0x79000UL)
#define USBD_BASE            (APBPERIPH_BASE + 0x80000UL)
#define USCI0_BASE           (APBPERIPH_BASE + 0x90000UL)
#define USCI1_BASE           (APBPERIPH_BASE + 0x91000UL)

#define EWDT_BASE            (APBPERIPH_BASE + 0x02000UL)
#define EWWDT_BASE           (APBPERIPH_BASE + 0x02100UL)


#define KS_BASE              (AHBPERIPH_BASE + 0x35000UL)
#define TAMPER_BASE          (AHBPERIPH_BASE + 0xBD000UL)
#define LCD_BASE             (AHBPERIPH_BASE + 0xBB000UL)



/**@}*/ /* PERIPHERAL */

/******************************************************************************/
/*                         Peripheral declaration                             */
/******************************************************************************/

/** @addtogroup PMODULE Peripheral Pointer
  The Declaration of Peripheral Pointer
  @{
 */

/** @addtogroup PMODULE_S Secure Peripheral Pointer
 The Declaration of Secure Peripheral Pointer
 @{
*/

#define PA_S                  ((GPIO_T *) GPIOA_BASE)                     /*!< GPIO PORTA Pointer                 */
#define PB_S                  ((GPIO_T *) GPIOB_BASE)                     /*!< GPIO PORTB Pointer                 */
#define PC_S                  ((GPIO_T *) GPIOC_BASE)                     /*!< GPIO PORTC Pointer                 */
#define PD_S                  ((GPIO_T *) GPIOD_BASE)                     /*!< GPIO PORTD Pointer                 */
#define PE_S                  ((GPIO_T *) GPIOE_BASE)                     /*!< GPIO PORTE Pointer                 */
#define PF_S                  ((GPIO_T *) GPIOF_BASE)                     /*!< GPIO PORTF Pointer                 */
#define PG_S                  ((GPIO_T *) GPIOG_BASE)                     /*!< GPIO PORTG Pointer                 */
#define PH_S                  ((GPIO_T *) GPIOH_BASE)                     /*!< GPIO PORTH Pointer                 */

#define UART0_S               ((UART_T *) UART0_BASE)                     /*!< UART0 Pointer                      */
#define UART1_S               ((UART_T *) UART1_BASE)                     /*!< UART1 Pointer                      */
#define UART2_S               ((UART_T *) UART2_BASE)                     /*!< UART2 Pointer                      */
#define UART3_S               ((UART_T *) UART3_BASE)                     /*!< UART3 Pointer                      */
#define UART4_S               ((UART_T *) UART4_BASE)                     /*!< UART4 Pointer                      */
#define UART5_S               ((UART_T *) UART5_BASE)                     /*!< UART5 Pointer                      */


#define TIMER0_S              ((TIMER_T *) TMR01_BASE)                    /*!< TIMER0 Pointer                      */
#define TIMER1_S              ((TIMER_T *) (TMR01_BASE + 0x100UL))        /*!< TIMER1 Pointer                      */
#define TIMER2_S              ((TIMER_T *) TMR23_BASE)                    /*!< TIMER2 Pointer                      */
#define TIMER3_S              ((TIMER_T *) (TMR23_BASE + 0x100UL))        /*!< TIMER3 Pointer                      */
#define TIMER4_S              ((TIMER_T *) TMR45_BASE)                    /*!< TIMER4 Pointer                      */
#define TIMER5_S              ((TIMER_T *) (TMR45_BASE + 0x100UL))        /*!< TIMER5 Pointer                      */

#define WDT_S                 ((WDT_T *) WDT_BASE)                        /*!< Watch Dog Timer Pointer             */

#define WWDT_S                ((WWDT_T *) WWDT_BASE)                      /*!< Window Watch Dog Timer Pointer      */

#define QSPI0_S               ((QSPI_T *) QSPI0_BASE)                     /*!< QSPI0 Pointer                       */
#define SPI0_S                ((SPI_T *) SPI0_BASE)                       /*!< SPI0 Pointer                        */
#define SPI1_S                ((SPI_T *) SPI1_BASE)                       /*!< SPI1 Pointer                        */
#define SPI2_S                ((SPI_T *) SPI2_BASE)                       /*!< SPI2 Pointer                        */
#define SPI3_S                ((SPI_T *) SPI3_BASE)                       /*!< SPI3 Pointer                        */

#define I2S0_S                ((I2S_T *) I2S0_BASE)                       /*!< I2S0 Pointer                        */

